mdhardenburgh/Blinky/Packages/.cache/NXP.MIMXRT1052_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="Startup" Csub="MIMXRT1052_startup" Cversion="1.0.0" condition="device.MIMXRT1052_AND_CMSIS_Include_core_cm7">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MIMXRT1052.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MIMXRT1052.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1052xxxxx_flexspi_nor.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1052xxxxx_flexspi_nor_sdram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1052xxxxx_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1052xxxxx_sdram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1052xxxxx_sdram_txt.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1052xxxxx_flexspi_nor.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1052xxxxx_flexspi_nor_sdram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1052xxxxx_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1052xxxxx_sdram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1052xxxxx_sdram_txt.icf"/>
        <file category="header" attr="config" name="MIMXRT1052.h"/>
        <file category="header" attr="config" name="MIMXRT1052_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_MIMXRT1052.c"/>
        <file category="header" attr="config" name="system_MIMXRT1052.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_12b1msps_sar" Cversion="2.0.2" condition="device.MIMXRT1052_AND_driver.common">
      <description>ADC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.0.1" condition="device.MIMXRT1052_AND_driver.common">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc_etc.c"/>
        <file category="header" name="drivers/fsl_adc_etc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aipstz" Cversion="2.0.0" condition="device.MIMXRT1052_AND_driver.common">
      <description>aipstz Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_aipstz.c"/>
        <file category="header" name="drivers/fsl_aipstz.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.0" condition="device.MIMXRT1052_AND_driver.common">
      <description>AOI Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_aoi.c"/>
        <file category="header" name="drivers/fsl_aoi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bee" Cversion="2.0.0" condition="device.MIMXRT1052_AND_driver.common">
      <description>BEE Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_bee.c"/>
        <file category="header" name="drivers/fsl_bee.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache" Cversion="2.0.1" condition="device.MIMXRT1052_AND_driver.common">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cache.c"/>
        <file category="header" name="drivers/fsl_cache.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="device.MIMXRT1052_AND_driver.video-common">
      <description/>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="device.MIMXRT1052_AND_driver.camera-common_AND_driver.common">
      <description/>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.0" condition="device.MIMXRT1052_AND_driver.camera-common_AND_driver.camera-device-common_AND_driver.video-common_AND_driver.video-i2c">
      <description/>
      <files>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c"/>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7725" Cversion="1.0.0" condition="device.MIMXRT1052_AND_driver.camera-common_AND_driver.camera-device-common_AND_driver.camera-device-sccb_AND_driver.video-common">
      <description/>
      <files>
        <file category="sourceC" name="components/video/camera/device/ov7725/fsl_ov7725.c"/>
        <file category="header" name="components/video/camera/device/ov7725/fsl_ov7725.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb" Cversion="1.0.0" condition="device.MIMXRT1052_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/video/camera/device/sccb/fsl_sccb.c"/>
        <file category="header" name="components/video/camera/device/sccb/fsl_sccb.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-common" Cversion="1.0.0" condition="device.MIMXRT1052_AND_driver.camera-common_AND_driver.video-common">
      <description/>
      <files>
        <file category="header" name="components/video/camera/receiver/fsl_camera_receiver.h"/>
      </files>
    </component>
